package Library;

public class Students{
//Найти и вывести два наименьших уникальных элемента массива.
//Необходимо учесть случаи, когда массив имеет повторяющиеся числа.

//Перемешать элементы массива в случайном порядке.
//Вам понадобится использовать функцию для генерации случайных чисел.

//Найдите элемент массива, который делит массив на две части таким образом, что сумма элементов влево от него равна сумме элементов справа от него.
//Если такого элемента нет, верните соответствующее сообщение.

//Найдите длину самой длинной подпоследовательности, состоящей из одинаковых чисел.
}
