package Arrays;

public class Test {
    public static void main(String[] args) {
//        Развернуть элементы массива таким образом, чтобы последний элемент стал первым, предпоследний стал вторым и т. д..
//        int[] nums = {1, 2, 3, 4, 5};
//        System.out.print("{");
//        for (int i = nums.length - 1; i > 0; i--) {
//            System.out.print(nums[i] + ", ");
//        }
//        System.out.print(nums[0] + "}");

//        Найти элемент массива, у которого сумма всех элементов слева от него равна сумме всех элементов справа от него. Если таких элементов несколько, верните их все.
//        int[] nums = {1, 3, 5, 2, 5, 7, 7, 3};
//        for (int i = 1; i < nums.length - 1; i++) {
//            if (nums[i] == nums[i - 1] + nums[i + 1]) {
//                System.out.println(nums[i]);
//            }
//        }


//        Дан массив чисел. Найдите самую длинную подпоследовательность, в которой все числа идут по возрастанию.
//        int[] nums = {1, 2, 3, 1, 2, 3, 4, 5};
//        for (int i = 0; i < nums.length - 1; i++) {
//            if (nums[i] < nums[i + 1]) {
//                if (nums[i] >= nums[i + 1]) {
//                    continue;
//                } else {
//                    System.out.println(nums[i]);
//                }
//            }
//        }

//        int[] nums = {0, 1, 9, 0, 3, 12, 0};
//        int a;
//        for(int i = 0;i < nums.length - 1;i++) {
//            if (nums[i] == 0){
//                a = nums[i];
//                nums[i] = nums[i + 1];
//                nums[i + 1] = a;
//            }
//            System.out.println(nums[i]);
//        }


    }
}
